পাইথনে জাভাস্ক্রিপ্টের মতো অফিশিয়াল কোনো const কিওয়ার্ড বা ভেরিয়েবল নেই। জাভাস্ক্রিপ্টে  একবার const x = 10; লিখলে পরে চাইলেও x = 20; করতে পারেন না (এরর দেয়)। 
কিন্তু পাইথনে সব ভেরিয়েবলই ডিফল্টভাবে পরিবর্তনশীল বা Mutable। যেকোনো ভেরিয়েবলের মান যেকোনো সময় বদলে দিতে পারেন।

তবে ব্যাকএন্ড ইঞ্জিনিয়ারিং বা বড় বড় প্রজেক্টে তো ধ্রুবক বা কনস্ট্যান্ট (যেমন: PI = 3.14 বা ডেটাবেজের পাসওয়ার্ড) ব্যবহার করতেই হয়। পাইথনে এই কনস্ট্যান্ট হ্যান্ডেল করার জন্য দুটি নিয়ম বা কনভেনশন মেনে চলা হয়:
১. ডেভেলপারদের নিয়ম: সব বড় হাতের অক্ষর (CAPITAL_LETTERS)

পাইথনে এটি একটি অলিখিত নিয়ম বা ভদ্রতা যে— যদি কোনো ভেরিয়েবলের মান পুরো প্রোগ্রামে আর পরিবর্তন করতে না চান, তবে তার নামসব বড় হাতের অক্ষরে লিখতে হয়।

পাইথন কোড লিখতে বাধা দেবে না, কিন্তু অন্য কোনো ডেভেলপার যখন কোড দেখবে, সে বড় হাতের অক্ষর দেখেই বুঝে যাবে: "ও আচ্ছা! এটা একটা কনস্ট্যান্ট, এটার মান পরিবর্তন করা যাবে না।"

# --- পাইথন কনস্ট্যান্ট কনভেনশন ---
DATABASE_URL = "localhost:5432"
PI = 3.1416
MAX_LOGIN_ATTEMPTS = 5

# পাইথন এটি পরিবর্তন করতে বাধা দেবে না:
PI = 5.00  # কোড রান হবে, কিন্তু এটি করা নিয়ম বহির্ভূত (Bad Practice)

২. টাইপ হিন্ট ব্যবহার করে কঠোর নিয়ম: Final

যদি চাওয়া হয় জাভাস্ক্রিপ্টের const-এর মতো পাইথনেও একদম কড়া নিয়ম থাকুক, যাতে কেউ ভুল করে মান পরিবর্তন করতে গেলে কোড এডিটর (যেমন VS Code) এরর বা ওয়ার্নিং দেখাক, 
তবে পাইথনের typing মডিউল থেকে Final ব্যবহার করা যেতে পারে। 

from typing import Final

# ভেরিয়েবলের নামের পাশে :Final লিখে দেওয়া
NID_NUMBER: Final = "1997541258745"
COUNTRY: Final = "Bangladesh"

# এখন যদি নিচে এটি পরিবর্তন করতে গেলে:
COUNTRY = "USA" 
# আপনার কোড এডিটর (VS Code / PyCharm) সাথে সাথে নিচে লাল দাগ দিয়ে ওয়ার্নিং দেখাবে!
