পাইথন কী?
পাইথন একটি জনপ্রিয় প্রোগ্রামিং ভাষা। এটি গুইডো ভ্যান রসাম তৈরি করেন এবং ১৯৯১ সালে এটি প্রকাশিত হয়।

এটি ব্যবহৃত হয়:

ওয়েব ডেভেলপমেন্ট (সার্ভার-সাইড),
সফটওয়্যার ডেভেলপমেন্ট,
গণিত,
সিস্টেম স্ক্রিপ্টিং-এ।


পাইথন কী করতে পারে?
সার্ভারে ওয়েব অ্যাপ্লিকেশন তৈরি করতে পাইথন ব্যবহার করা যায়।
সফটওয়্যারের পাশাপাশি ওয়ার্কফ্লো তৈরি করতে পাইথন ব্যবহার করা যায়।
পাইথন ডাটাবেস সিস্টেমের সাথে সংযোগ স্থাপন করতে পারে। এটি ফাইল পড়তে এবং পরিবর্তন করতেও পারে।
বিগ ডেটা পরিচালনা করতে এবং জটিল গাণিতিক কাজ সম্পাদন করতে পাইথন ব্যবহার করা যায়।
দ্রুত প্রোটোটাইপিং বা প্রোডাকশন-রেডি সফটওয়্যার ডেভেলপমেন্টের জন্য পাইথন ব্যবহার করা যেতে পারে।

পাইথন কেন?
পাইথন বিভিন্ন প্ল্যাটফর্মে (উইন্ডোজ, ম্যাক, লিনাক্স, রাস্পবেরি পাই, ইত্যাদি) কাজ করে।
পাইথনের সিনট্যাক্স ইংরেজি ভাষার মতো সহজ।
পাইথনের সিনট্যাক্স ডেভেলপারদের অন্য কিছু প্রোগ্রামিং ভাষার তুলনায় কম লাইনে প্রোগ্রাম লিখতে সাহায্য করে।
পাইথন একটি ইন্টারপ্রেটার সিস্টেমে চলে, যার মানে হলো কোড লেখার সাথে সাথেই তা চালানো যায়। এর ফলে প্রোটোটাইপিং খুব দ্রুত করা সম্ভব।
পাইথনকে প্রসিডিউরাল, অবজেক্ট-ওরিয়েন্টেড বা ফাংশনাল পদ্ধতিতে ব্যবহার করা যায়।

জেনে রাখা ভালো

পাইথনের সবচেয়ে সাম্প্রতিক প্রধান সংস্করণ হলো পাইথন ৩, যা আমরা এই টিউটোরিয়ালে ব্যবহার করব।

এই টিউটোরিয়ালে একটি টেক্সট এডিটরে পাইথন লেখা হবে। থনি, পাইচার্ম, নেটবিনস বা এক্লিপ্স-এর মতো ইন্টিগ্রেটেড ডেভেলপমেন্ট এনভায়রনমেন্টেও পাইথন লেখা সম্ভব, যা বিপুল সংখ্যক পাইথন ফাইল ব্যবস্থাপনার ক্ষেত্রে বিশেষভাবে উপযোগী।



অন্যান্য প্রোগ্রামিং ভাষার সাথে পাইথন সিনট্যাক্সের তুলনা
পাইথন পঠনযোগ্যতার কথা মাথায় রেখে ডিজাইন করা হয়েছে এবং গণিতের প্রভাবসহ এর সাথে ইংরেজি ভাষার কিছু সাদৃশ্য রয়েছে।
পাইথন কোনো কমান্ড সম্পূর্ণ করতে নতুন লাইন ব্যবহার করে, যেখানে অন্যান্য প্রোগ্রামিং ভাষাগুলো প্রায়শই সেমিকোলন বা প্রথম বন্ধনী ব্যবহার করে।
পাইথন স্কোপ (যেমন লুপ, ফাংশন এবং ক্লাসের স্কোপ) নির্ধারণ করতে হোয়াইটস্পেস ব্যবহার করে ইন্ডেন্টেশনের উপর নির্ভর করে। অন্যান্য প্রোগ্রামিং ভাষাগুলো এই উদ্দেশ্যে প্রায়শই কার্লি-ব্র্যাকেট ব্যবহার করে।


print("Hello World");
ভুলটি হলো লাইনের শেষের সেমিকোলন (;)।

পাইথনে কোনো লাইনের শেষে সেমিকোলন দেওয়া লাগে না। সেমিকোলন দিলে পাইথন রাগ করে না (এরর দেবে না), কিন্তু পাইথনের স্ট্যান্ডার্ড নিয়ম অনুযায়ী এটি বাদ দেওয়াই শ্রেয়।

সঠিক এবং পারফেক্ট পাইথন কোড:
print("Hello World")

কেন এই পার্থক্য?

C / C++ / JS-এ: একটি লাইনের কাজ শেষ বোঝাতে কম্পাইলারকে সেমিকোলন (;) দিয়ে জানাতে হয়।

Python-এ: পাইথন খুব সাধারণ ইংরেজি ভাষার মতো। এখানে লাইন শেষ করে এন্টার (Enter) চেপে নতুন লাইনে গেলেই পাইথন বুঝে নেয় যে আগের লাইনের কাজ শেষ।
