পাইথন keyword হলো এমন কিছু reserved word (নির্দিষ্ট শব্দ), যার একটি বিশেষ অর্থ ও কাজ রয়েছে পাইথন প্রোগ্রামিং ল্যাঙ্গুয়েজে। এগুলি কোড লেখার সময় variable, function বা class-এর নাম হিসেবে ব্যবহার করা যায় না।
পাইথনে বর্তমানে প্রায় ৩৫-৩৬টি কিওয়ার্ড আছে (পাইথনের ভার্সন অনুযায়ী দু-একটা কম-বেশি হতে পারে)।

বুলিয়ান ও নান	True, False, None	সত্য, মিথ্যা বা খালি মান বোঝাতে।

লজিক্যাল অপারেটর	and, or, not	জাভাস্ক্রিপ্টের &&, ||, ! এর মতো কাজ করে।

কন্ডিশনাল লজিক	if, elif, else	শর্ত চেক করার জন্য।

লুপ বা চক্র	for, while, break, continue	একই কোড বারবার চালানোর জন্য।

টুলস ও ফাংশনdef, return, import, fromফাংশন ও মডিউল নিয়ে কাজ করতে।

কম্পিউটারে সব কিওয়ার্ড দেখার ট্রিক:

import keyword

# পাইথনের সব কিওয়ার্ডের লিস্ট প্রিন্ট করা
print(keyword.kwlist)

import keyword
সহজ কথায়: keyword নামটা যেমন একটা সাধারণ শব্দ বা কনসেপ্ট, পাইথনে ঠিক এই নামেরই একটা রেডিমেড "টুলবক্স বা মডিউল"ও আছে।

১. keyword শব্দ বনাম keyword টুলবক্স 
শব্দ বা কনসেপ্ট হিসেবে: পাইথনে যে ৩৫/৩৬টি বিশেষ শব্দ ব্যবহার করা হয়, সেগুলোকে ব্যাকরণগতভাবে "keyword" বলা হয়।'

টুলবক্স (Module) হিসেবে: পাইথন ডেভেলপাররা সুবিধার জন্য ব্যাকগ্রাউন্ডে একটা পাইথন ফাইল বা মডিউল বানিয়ে রেখেছেন, যার নাম দিয়েছেন keyword.py। 
এই টুলবক্সটার কাজই হলো পাইথনের কিওয়ার্ড সম্পর্কিত বিভিন্ন তথ্য হিসাব করা।

import keyword লিখছি, তখন আসলে ওই keyword.py নামক বিশেষ টুলবক্সটাকে আমাদের কোডে ডেকে আনছি।

এই keyword টুলবক্সটার মূলত দুটি প্রধান কাজ আছে, যার জন্য ডেভেলপাররা এটি ব্যবহার করেন:

ক) সব কিওয়ার্ডের তালিকা দেখা (keyword.kwlist)
পাইথনের আপডেট বা নতুন ভার্সনে কোনো নতুন কিওয়ার্ড যোগ হয়েছে কিনা, তা জানার জন্য এই টুলবক্সের ভেতর একটি রেডিমেড লিস্ট বা তালিকা রাখা আছে।

import keyword
# এই kwlist হলো ওই টুলবক্সের ভেতরের একটা রেডিমেড ডায়েরি বা লিস্ট
print(keyword.kwlist)


খ) কোনো শব্দ কিওয়ার্ড কিনা তা চেক করা (keyword.iskeyword())
 ইউজার বা কোনো ইউজারের ইনপুট থেকে একটা নাম নিলেন। এখন ব্যাকএন্ড সিস্টেমে চেক করা দরকার যে— ইউজার যে নামটি দিয়েছে, ওটা কি পাইথনের কোনো নিষিদ্ধ কিওয়ার্ড? নাকি ওটা সাধারণ নাম?

 import keyword
# 'if' কি পাইথনের কিওয়ার্ড?
print(keyword.iskeyword("if"))      # আউটপুট আসবে: True

# 'aziz' কি পাইথনের কিওয়ার্ড?
print(keyword.iskeyword("aziz"))    # আউটপুট আসবে: False


import keyword লাইনে  কোনো কিওয়ার্ড তৈরি করছি না, বরং পাইথনে আগে থেকে বানিয়ে রাখা keyword নামের একটি হেল্পার বা অ্যাসিস্ট্যান্ট টুলবক্সকে ইমপোর্ট করছি,
যাতে সে বলে দিতে পারে পাইথনের কোন কোন শব্দগুলো নিষিদ্ধ বা কিওয়ার্ড।
