স্টেটমেন্ট 

একটি কম্পিউটার প্রোগ্রাম হলো কম্পিউটারের দ্বারা "কার্যকর" করার জন্য "নির্দেশাবলীর" একটি তালিকা।

একটি প্রোগ্রামিং ভাষায়, এই প্রোগ্রামিং নির্দেশাবলীকে স্টেটমেন্ট বলা হয়।

নিম্নলিখিত স্টেটমেন্টটি স্ক্রিনে "Python is fun!" লেখাটি প্রিন্ট করে:

print("Python is fun!") 

পাইথনে, একটি স্টেটমেন্ট সাধারণত লাইনের শেষে শেষ হয়। অন্যান্য অনেক প্রোগ্রামিং ভাষার (যেমন, জাভা বা সি) মতো সেমিকোলন (;) ব্যবহার করার প্রয়োজন হয় না।

অনেক স্টেটমেন্ট

বেশিরভাগ পাইথন প্রোগ্রামে অনেক স্টেটমেন্ট থাকে।

স্টেটমেন্টগুলো যে ক্রমে লেখা হয়, ঠিক সেই ক্রমেই এক এক করে এক্সিকিউট করা হয়:

print("Hello World!")
print("Have a good day.")
print("Learning Python is fun!")

উদাহরণের ব্যাখ্যা
উপরের উদাহরণ থেকে, তিনটি বিবৃতি পাই:

print("Hello World!")
print("Have a good day.")
print("Learning Python is fun!")

প্রথমে প্রথম স্টেটমেন্টটি এক্সিকিউট করা হয় (print "Hello World!")।


তারপর দ্বিতীয় স্টেটমেন্টটি এক্সিকিউট করা হয় (print "Have a good day.")।


এবং সবশেষে, তৃতীয় স্টেটমেন্টটি এক্সিকিউট করা হয় (print "Learning Python is fun!")।

সেমিকোলন (ঐচ্ছিক, খুব কম ব্যবহৃত)
পাইথনে সেমিকোলন ঐচ্ছিক। সেমিকোলন দিয়ে একাধিক স্টেটমেন্টকে আলাদা করে এক লাইনে লিখতে পারেন, কিন্তু এটি খুব কমই ব্যবহৃত হয় কারণ এটি পড়তে অসুবিধা করে তোলে:

print("Hello"); print("How are you?"); print("Bye bye!")

তবে, যদি  কোনো বিভাজক (নিউলাইন বা ;) ছাড়া একই লাইনে দুটি স্টেটমেন্ট রাখেন, তাহলে পাইথন একটি এরর দেবে:

print("Python is fun!") print("Really!")

SyntaxError: invalid syntax

যদি এক লাইনেই সবগুলো ভেরিয়েবল প্রিন্ট করতে চাওয়া হয়, তবে সেমিকোলন ব্যবহার করার চেয়ে পাইথনের স্ট্যান্ডার্ড বা সঠিক নিয়ম হলো কমা ( , ) ব্যবহার করা।

name1 = "Abdullah"
name2 = 'Abdullah'
name3 = '''Abdullah'''
name4 = """Abdullah"""

print(name1, name2, name3, name4)
# আউটপুট: Abdullah Abdullah Abdullah Abdullah
সুবিধা: এক লাইনেই সব প্রিন্ট হবে এবং পাইথন নিজে থেকেই প্রতিটা নামের মাঝে একটি করে স্পেস (খালি জায়গা) দিয়ে দেবে।


সেমিকোলন দিয়ে লিখতে চাইলে (শেষে বাংলা কমেন্ট সহ)

name1 = "Abdullah"; name2 = 'Abdullah'; name3 = '''Abdullah'''; name4 = """Abdullah"""

print(name1); print(name2); print(name3); print(name4)  # এভাবে প্রিন্ট করলে কোনো প্রবলেম নেই
